# Fundamentals
a place to play with python

In [3]:
import numpy as np
import pandas as pd
from matplotlib import pyplot as plt

# Simplest Data Frames
are a table of numbers of the same type
The default index is a range of numbers 
The default columns is a range of numbers

In [13]:
df = pd.DataFrame([[1,2,3],[4,5,6],[2,3,4],[3,4,5]])
df

   0  1  2
0  1  2  3
1  4  5  6
2  2  3  4
3  3  4  5

In [7]:
list(df.index)

[0, 1, 2, 3]

In [60]:
list(df.columns)

[0, 1, 2]

# changing the index and the columns
We can assign different values for the index or the columns

In [14]:
df.index=["a","b","c","d"]
df.columns=["one","two","three"]
df

   one  two  three
a    1    2      3
b    4    5      6
c    2    3      4
d    3    4      5

# Accessing a subset of columns
We can access a single column with
```
df[COLNAME]
```
and access a set of columns with a list of column names
but this doesn't change the underlying data frame, it just gives another view of the data

In [15]:
z = df[["three","one"]]

In [16]:
df['three','a']=77

# Accessing a single row of a dataframe
We can access a single row either by the row number using iloc[...]
```
df.iloc[1]
```
or by the index name with loc[...]
```
df.loc["b"]
```

In [64]:
df.iloc[1]

one      4
two      5
three    6
Name: b, dtype: int64

In [65]:
df.loc["b"]

one      4
two      5
three    6
Name: b, dtype: int64

# Viewing a subset of rows
We can also access a subset of rows by passing in a boolean array stating which indices should be included

In [72]:
df

   one  two  three
a    1    2      3
b    4    5      6
c    2    3      4
d    3    4      5

In [68]:
df[[True,False,True,False]]

   one  two  three
a    1    2      3
c    2    3      4

# Generation boolean arrays by comparison ops
We can generate such boolean arrays by evaluating a condition 
and the conditions can be any numpy expressions compbined
with comparison o

In [74]:
df["two"]<16

a     True
b    False
c     True
d    False
Name: two, dtype: bool

In [71]:
df[df["two"]<4]

   one  two  three
a    1    2      3
c    2    3      4

In [17]:
z

   three  one
a      3    1
b      6    4
c      4    2
d      5    3

In [18]:
df

   one  two  three  (three, a)
a    1    2      3          77
b    4    5      6          77
c    2    3      4          77
d    3    4      5          77